src/Documents/Крафт/Крафт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Крафт</name>
  <registerRecords>AccumulationRegister.Камни</registerRecords>
  <registerRecords>AccumulationRegister.Руны</registerRecords>
  <attributes>
    <name>Результат</name>
    <type>
      <types>CatalogRef.РунныеСлова</types>
      <types>CatalogRef.Рецепты</types>
    </type>
  </attributes>
  <attributes>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.Руны</types>
        <types>CatalogRef.Камни</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Руны/Руны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Руны</name>
  <resources>
    <name>КоличествоВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Руна</name>
    <type>
      <types>CatalogRef.Руны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Камни/Камни.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Камни</name>
  <resources>
    <name>КоличествоВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Камень</name>
    <type>
      <types>CatalogRef.Камни</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Рецепты/Рецепты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рецепты</name>
  <attributes>
    <name>Результат</name>
    <type>
      <types>CatalogRef.Руны</types>
      <types>CatalogRef.Камни</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рецепт</name>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.Руны</types>
        <types>CatalogRef.Камни</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Крафт/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВремТЗ = Ресурсы.Выгрузить();
	ВремТЗ.Свернуть("Предмет", "Количество");
	
	НаборЗаписейРуны = Движения.Руны;
	НаборЗаписейРуны.Записывать = Истина;
	
	НаборЗаписейКамни = Движения.Камни;
	НаборЗаписейКамни.Записывать = Истина;
	
	Для Каждого СтрокаТЗ Из ВремТЗ Цикл
		Если ТипЗнч(СтрокаТЗ.Предмет) = Тип("СправочникСсылка.Руны") Тогда
			НоваяСтрока = НаборЗаписейРуны.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Персонаж = Персонаж;
			НоваяСтрока.Руна = СтрокаТЗ.Предмет;
			НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
		ИначеЕсли ТипЗнч(СтрокаТЗ.Предмет) = Тип("СправочникСсылка.Камни") Тогда 
			НоваяСтрока = НаборЗаписейКамни.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Камень = СтрокаТЗ.Предмет;
			НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
		Иначе
			ВызватьИсключение "хуй";
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Рецепты.Результат КАК Результат
	|ИЗ
	|	Справочник.Рецепты КАК Рецепты
	|ГДЕ
	|	Рецепты.Ссылка = &Ссылка";         
	Запрос.УстановитьПараметр("Ссылка", Результат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.Результат) = Тип("СправочникСсылка.Руны") Тогда
			НоваяСтрока = НаборЗаписейРуны.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяСтрока.Персонаж = Персонаж;
			НоваяСтрока.Руна = Выборка.Результат;
			НоваяСтрока.КоличествоВНаличии = 1; 
		ИначеЕсли ТипЗнч(СтрокаТЗ.Результат) = Тип("СправочникСсылка.Камни") Тогда 
			НоваяСтрока = НаборЗаписейКамни.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Камень = Выборка.Результат;
			НоваяСтрока.КоличествоВНаличии = 1;
		Иначе
			ВызватьИсключение "хуй";
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
